[
  {
    "record_id": 1890041,
    "text": "Customer reported the following issue: Cus not satisfied with service. want to port out to Idea network.. The issue is categorized under Port Out.",
    "category": "Port Out"
  },
  {
    "record_id": 1890042,
    "text": "Customer reported the following issue: Jadav called to check his porting out status. Shared information with him.. The issue is categorized under Port Out.",
    "category": "Port Out"
  },
  {
    "record_id": 1890043,
    "text": "Customer reported the following issue: Customer thraetened to cancel her service. Said Idea is offerring much better options.. The issue is categorized under Port Out.",
    "category": "Port Out"
  },
  {
    "record_id": 1890044,
    "text": "Customer reported the following issue: called to ask steps for porting out. She is leaving India.. The issue is categorized under Port Out.",
    "category": "Port Out"
  },
  {
    "record_id": 1890045,
    "text": "Customer reported the following issue: Customer dissatisfied with support. Connectivity is poor in his region. Wanted to port to BSNL.. The issue is categorized under Port Out.",
    "category": "Port Out"
  },
  {
    "record_id": 1890046,
    "text": "Customer reported the following issue: port out Options. >> Tried to retain. >> Xferred to Manager.. The issue is categorized under Port Out.",
    "category": "Port Out"
  },
  {
    "record_id": 1890047,
    "text": "Customer reported the following issue: Customer wanted port out. Transferred to offer better plans to retain.. The issue is categorized under Port Out.",
    "category": "Port Out"
  },
  {
    "record_id": 1890048,
    "text": "Customer reported the following issue: Kumar called to ask about his porting status. Moving to BSNL.. The issue is categorized under Port Out.",
    "category": "Port Out"
  },
  {
    "record_id": 1890049,
    "text": "Customer reported the following issue: Cus wanted to cancel the connection. Transferred to port-out Management Team. The issue is categorized under Port Out.",
    "category": "Port Out"
  },
  {
    "record_id": 1890050,
    "text": "Customer reported the following issue: porting out because of high bill on Data Plans.. The issue is categorized under Port Out.",
    "category": "Port Out"
  },
  {
    "record_id": 1890051,
    "text": "Customer reported the following issue: Nicki called to inform poor connectivity in Kannur region.. The issue is categorized under Poor Connectivity.",
    "category": "Poor Connectivity"
  },
  {
    "record_id": 1890052,
    "text": "Customer reported the following issue: Low speed connection reported in Uppala area.. The issue is categorized under Poor Connectivity.",
    "category": "Poor Connectivity"
  },
  {
    "record_id": 1890053,
    "text": "Customer reported the following issue: Cellular connection speed is less than 1MBps. asked Operator to check the device.. The issue is categorized under Poor Connectivity.",
    "category": "Poor Connectivity"
  },
  {
    "record_id": 1890054,
    "text": "Customer reported the following issue: 8289716467 called to complain about the connection speed.. The issue is categorized under Poor Connectivity.",
    "category": "Poor Connectivity"
  },
  {
    "record_id": 1890055,
    "text": "Customer reported the following issue: New customer facing internet speed issues. asked to restart device & connect again.. The issue is categorized under Poor Connectivity.",
    "category": "Poor Connectivity"
  },
  {
    "record_id": 1890056,
    "text": "Customer reported the following issue: Low/poor connectivity during day-time. Customer want to increase net speed.. The issue is categorized under Poor Connectivity.",
    "category": "Poor Connectivity"
  },
  {
    "record_id": 1890057,
    "text": "Customer reported the following issue: Want 3G connection in his area.. The issue is categorized under Poor Connectivity.",
    "category": "Poor Connectivity"
  },
  {
    "record_id": 1890058,
    "text": "Customer reported the following issue: Poor call quality. Checked on the connection speed which was below average.. The issue is categorized under Poor Connectivity.",
    "category": "Poor Connectivity"
  },
  {
    "record_id": 1890059,
    "text": "Customer reported the following issue: Customer facing issues in connectivity from yesterday onwards. Promised resloution.. The issue is categorized under Poor Connectivity.",
    "category": "Poor Connectivity"
  },
  {
    "record_id": 1890060,
    "text": "Customer reported the following issue: 935468R911 called to report abrupt disconection from network.. The issue is categorized under Poor Connectivity.",
    "category": "Poor Connectivity"
  },
  {
    "record_id": 1890061,
    "text": "Customer reported the following issue: Regina complained about high bill for last month.. The issue is categorized under High Bill.",
    "category": "High Bill"
  },
  {
    "record_id": 1890062,
    "text": "Customer reported the following issue: Data plans are very expensive complained 7563453326678. The issue is categorized under High Bill.",
    "category": "High Bill"
  },
  {
    "record_id": 1890063,
    "text": "Customer reported the following issue: Customer can't afford monthly bills as they are very expensive.. The issue is categorized under High Bill.",
    "category": "High Bill"
  },
  {
    "record_id": 1890064,
    "text": "Customer reported the following issue: Want Senior citizen discount in monthly bills.. The issue is categorized under High Bill.",
    "category": "High Bill"
  },
  {
    "record_id": 1890065,
    "text": "Customer reported the following issue: Long time customer complaining about high bill. Offerred assistance. The issue is categorized under High Bill.",
    "category": "High Bill"
  },
  {
    "record_id": 1890066,
    "text": "Customer reported the following issue: Cus want to enquire about the high bill for recent weeks. asked for cheap plans.. The issue is categorized under High Bill.",
    "category": "High Bill"
  },
  {
    "record_id": 1890067,
    "text": "Customer reported the following issue: Want to review bills for last month as they are abnormally high.. The issue is categorized under High Bill.",
    "category": "High Bill"
  },
  {
    "record_id": 1890068,
    "text": "Customer reported the following issue: Bill value for last month is high. Customer want to cancel the plan.. The issue is categorized under High Bill.",
    "category": "High Bill"
  },
  {
    "record_id": 1890069,
    "text": "Customer reported the following issue: High bill. Can't afford new plans. Reduce call volume per month.. The issue is categorized under High Bill.",
    "category": "High Bill"
  },
  {
    "record_id": 1890070,
    "text": "Customer reported the following issue: Want to know about offers on recent bill as he got high nill for last month.. The issue is categorized under High Bill.",
    "category": "High Bill"
  },
  {
    "record_id": 1890071,
    "text": "Customer reported the following issue: Cus travelling for nect month. Checked roaming plans. The issue is categorized under Roaming Plans.",
    "category": "Roaming Plans"
  },
  {
    "record_id": 1890072,
    "text": "Customer reported the following issue: All India plans for Data usage. Don't want incoming call being charged.. The issue is categorized under Roaming Plans.",
    "category": "Roaming Plans"
  },
  {
    "record_id": 1890073,
    "text": "Customer reported the following issue: Inquired about roaming charges in Indian states.. The issue is categorized under Roaming Plans.",
    "category": "Roaming Plans"
  },
  {
    "record_id": 1890074,
    "text": "Customer reported the following issue: Customer want to change location of SIM to Bangalore and stop the roaming charges.. The issue is categorized under Roaming Plans.",
    "category": "Roaming Plans"
  },
  {
    "record_id": 1890075,
    "text": "Customer reported the following issue: Hari called to ask about roaming charges. Would be travelling all week.. The issue is categorized under Roaming Plans.",
    "category": "Roaming Plans"
  },
  {
    "record_id": 1890076,
    "text": "Customer reported the following issue: roaming charges too high. Customer on a one month tour to Spain.. The issue is categorized under Roaming Plans.",
    "category": "Roaming Plans"
  },
  {
    "record_id": 1890077,
    "text": "Customer reported the following issue: Customer still getting roaming alerts after getting home town. Adviced about roaming plans.. The issue is categorized under Roaming Plans.",
    "category": "Roaming Plans"
  },
  {
    "record_id": 1890078,
    "text": "Customer reported the following issue: Cus called to inquire about National roaming charges.. The issue is categorized under Roaming Plans.",
    "category": "Roaming Plans"
  },
  {
    "record_id": 1890079,
    "text": "Customer reported the following issue: Want to activate roaming mode in his device.. The issue is categorized under Roaming Plans.",
    "category": "Roaming Plans"
  },
  {
    "record_id": 1890080,
    "text": "Customer reported the following issue: Customer called in to check roaming plans outside country.. The issue is categorized under Roaming Plans.",
    "category": "Roaming Plans"
  },
  {
    "record_id": 1890081,
    "text": "Customer reported the following issue: 68347585642 want to add a new connection.. The issue is categorized under Add New Line.",
    "category": "Add New Line"
  },
  {
    "record_id": 1890082,
    "text": "Customer reported the following issue: Customer added a new line. Want to know the status.. The issue is categorized under Add New Line.",
    "category": "Add New Line"
  },
  {
    "record_id": 1890083,
    "text": "Customer reported the following issue: Added a new line. Offered the customer new plans.. The issue is categorized under Add New Line.",
    "category": "Add New Line"
  },
  {
    "record_id": 1890084,
    "text": "Customer reported the following issue: Want to add new line.. The issue is categorized under Add New Line.",
    "category": "Add New Line"
  },
  {
    "record_id": 1890085,
    "text": "Customer reported the following issue: Add a new line.. The issue is categorized under Add New Line.",
    "category": "Add New Line"
  },
  {
    "record_id": 1890086,
    "text": "Customer reported the following issue: Customer called to ask about adding a new line to one of his family member.. The issue is categorized under Add New Line.",
    "category": "Add New Line"
  },
  {
    "record_id": 1890087,
    "text": "Customer reported the following issue: Faisal wants to add a new business connection apart from his personal connection/. The issue is categorized under Add New Line.",
    "category": "Add New Line"
  },
  {
    "record_id": 1890088,
    "text": "Customer reported the following issue: Cus called to inquire about adding new line in a new location.. The issue is categorized under Add New Line.",
    "category": "Add New Line"
  },
  {
    "record_id": 1890089,
    "text": "Customer reported the following issue: Shaji added a new line. Want to know about his connection details.. The issue is categorized under Add New Line.",
    "category": "Add New Line"
  },
  {
    "record_id": 1890090,
    "text": "Customer reported the following issue: Newly added line not getting any calls.. The issue is categorized under Add New Line.",
    "category": "Add New Line"
  },
  {
    "record_id": 1890091,
    "text": "Customer reported the following issue: Customer wanted to deactivate existing plans.. The issue is categorized under Deactivate.",
    "category": "Deactivate"
  },
  {
    "record_id": 1890092,
    "text": "Customer reported the following issue: Deactivate current data plans to change to a new local pack.. The issue is categorized under Deactivate.",
    "category": "Deactivate"
  },
  {
    "record_id": 1890093,
    "text": "Customer reported the following issue: Customer deactivated Onam offer. Still receiving emails & sms about the same.. The issue is categorized under Deactivate.",
    "category": "Deactivate"
  },
  {
    "record_id": 1890094,
    "text": "Customer reported the following issue: Veena wants to deactivate the plan due to unavailability of proper connection.. The issue is categorized under Deactivate.",
    "category": "Deactivate"
  },
  {
    "record_id": 1890095,
    "text": "Customer reported the following issue: Decativated all plans due to change of user.. The issue is categorized under Deactivate.",
    "category": "Deactivate"
  },
  {
    "record_id": 1890096,
    "text": "Customer reported the following issue: Deactivating current special plans due to insufficient balance.. The issue is categorized under Deactivate.",
    "category": "Deactivate"
  },
  {
    "record_id": 1890097,
    "text": "Customer reported the following issue: Customer terminated the offers permanently.. The issue is categorized under Deactivate.",
    "category": "Deactivate"
  },
  {
    "record_id": 1890098,
    "text": "Customer reported the following issue: Deactivation requires customer authentication.. The issue is categorized under Deactivate.",
    "category": "Deactivate"
  },
  {
    "record_id": 1890099,
    "text": "Customer reported the following issue: Manoj calls to deactivate the plans he currently has. rolls back to existing plans/. The issue is categorized under Deactivate.",
    "category": "Deactivate"
  },
  {
    "record_id": 1890100,
    "text": "Customer reported the following issue: 76578549708 wanted to deactivate the special offers applied to him as bonus.. The issue is categorized under Deactivate.",
    "category": "Deactivate"
  },
  {
    "record_id": 1890101,
    "text": "Customer reported the following issue: Ali want to change plans. He suggested to activate recent offers to his primary number,. The issue is categorized under Change Plans.",
    "category": "Change Plans"
  },
  {
    "record_id": 1890102,
    "text": "Customer reported the following issue: Cus called in to change plan.. The issue is categorized under Change Plans.",
    "category": "Change Plans"
  },
  {
    "record_id": 1890103,
    "text": "Customer reported the following issue: Plan change. Customer want to upgrade all offers with speed 1MBps.. The issue is categorized under Change Plans.",
    "category": "Change Plans"
  },
  {
    "record_id": 1890104,
    "text": "Customer reported the following issue: Plan changed. Cus happy about new plans & offers we have.. The issue is categorized under Change Plans.",
    "category": "Change Plans"
  },
  {
    "record_id": 1890105,
    "text": "Customer reported the following issue: Vineeth enquired about new plans. He wants to change his current plans.. The issue is categorized under Change Plans.",
    "category": "Change Plans"
  },
  {
    "record_id": 1890106,
    "text": "Customer reported the following issue: Customer wants to change plan to 3G. His current plan is not giving him extra hours at night.. The issue is categorized under Change Plans.",
    "category": "Change Plans"
  },
  {
    "record_id": 1890107,
    "text": "Customer reported the following issue: Hailey called to enquire about new plans. Educated her about the new offers. Agreed to change to Jumbo offer.. The issue is categorized under Change Plans.",
    "category": "Change Plans"
  },
  {
    "record_id": 1890108,
    "text": "Customer reported the following issue: Allen want to change to Jumbo offer. His current plan end this week.. The issue is categorized under Change Plans.",
    "category": "Change Plans"
  },
  {
    "record_id": 1890109,
    "text": "Customer reported the following issue: Cus called to understand procedures of changing to new plan.. The issue is categorized under Change Plans.",
    "category": "Change Plans"
  },
  {
    "record_id": 1890110,
    "text": "Customer reported the following issue: 865484876 called in to change the 3G existing plan.. The issue is categorized under Change Plans.",
    "category": "Change Plans"
  },
  {
    "record_id": 1890111,
    "text": "Customer reported the following issue: Customer wants to cancel all services & start new ones.. The issue is categorized under Cancel Service.",
    "category": "Cancel Service"
  },
  {
    "record_id": 1890112,
    "text": "Customer reported the following issue: John Meyer want to cancel the current connection.. The issue is categorized under Cancel Service.",
    "category": "Cancel Service"
  },
  {
    "record_id": 1890113,
    "text": "Customer reported the following issue: Cus called in to suspend celebration services. The issue is categorized under Cancel Service.",
    "category": "Cancel Service"
  },
  {
    "record_id": 1890114,
    "text": "Customer reported the following issue: Customer want to cancel service with immediate effect.. The issue is categorized under Cancel Service.",
    "category": "Cancel Service"
  },
  {
    "record_id": 1890115,
    "text": "Customer reported the following issue: Gregory cancelled his services temporarily.. The issue is categorized under Cancel Service.",
    "category": "Cancel Service"
  },
  {
    "record_id": 1890116,
    "text": "Customer reported the following issue: Cancelling services for a short period of time.. The issue is categorized under Cancel Service.",
    "category": "Cancel Service"
  },
  {
    "record_id": 1890117,
    "text": "Customer reported the following issue: Customer inquired about the cacellation policies.. The issue is categorized under Cancel Service.",
    "category": "Cancel Service"
  },
  {
    "record_id": 1890118,
    "text": "Customer reported the following issue: 8757486764 cancelled the existing plans 7 services.. The issue is categorized under Cancel Service.",
    "category": "Cancel Service"
  },
  {
    "record_id": 1890119,
    "text": "Customer reported the following issue: Xferred the call to cancellation & retention team.. The issue is categorized under Cancel Service.",
    "category": "Cancel Service"
  },
  {
    "record_id": 1890120,
    "text": "Customer reported the following issue: Customer called about cancelling the existing services to add new ones.. The issue is categorized under Cancel Service.",
    "category": "Cancel Service"
  },
  {
    "record_id": 1890121,
    "text": "Customer reported the following issue: Customer called to ask about his Data usage for the past one week.. The issue is categorized under Data Usage.",
    "category": "Data Usage"
  },
  {
    "record_id": 1890122,
    "text": "Customer reported the following issue: Higginbottoms called to check his son's data usage for the last month.. The issue is categorized under Data Usage.",
    "category": "Data Usage"
  },
  {
    "record_id": 1890123,
    "text": "Customer reported the following issue: Data Usage increased suddenly for the customer. Customer wants to know why.. The issue is categorized under Data Usage.",
    "category": "Data Usage"
  },
  {
    "record_id": 1890124,
    "text": "Customer reported the following issue: Called to check peak time Data Usage on an overall. Provided the Usage statistics of the customer,. The issue is categorized under Data Usage.",
    "category": "Data Usage"
  },
  {
    "record_id": 1890125,
    "text": "Customer reported the following issue: Wants to control the data usage during daytime & use it at night.. The issue is categorized under Data Usage.",
    "category": "Data Usage"
  },
  {
    "record_id": 1890126,
    "text": "Customer reported the following issue: Cus ants to increase data balance based on his daily usage.. The issue is categorized under Data Usage.",
    "category": "Data Usage"
  },
  {
    "record_id": 1890127,
    "text": "Customer reported the following issue: Customer called in to enquire data usage policies for a business requirement. Educated him on Business plans.. The issue is categorized under Data Usage.",
    "category": "Data Usage"
  },
  {
    "record_id": 1890128,
    "text": "Customer reported the following issue: Data usage statistics doesn't match with his actual usage. Customer concerned.. The issue is categorized under Data Usage.",
    "category": "Data Usage"
  },
  {
    "record_id": 1890129,
    "text": "Customer reported the following issue: More data usage leading to over heating of device. Reduced data balance.. The issue is categorized under Data Usage.",
    "category": "Data Usage"
  },
  {
    "record_id": 1890130,
    "text": "Customer reported the following issue: Data usage not matching with actual. Provided him last months report.. The issue is categorized under Data Usage.",
    "category": "Data Usage"
  },
  {
    "record_id": 1890131,
    "text": "Customer reported the following issue: Customer demise.. The issue is categorized under Others.",
    "category": "Others"
  },
  {
    "record_id": 1890132,
    "text": "Customer reported the following issue: IMEI Changed.. The issue is categorized under Others.",
    "category": "Others"
  },
  {
    "record_id": 1890133,
    "text": "Customer reported the following issue: Reported sad demise of customer.. The issue is categorized under Others.",
    "category": "Others"
  },
  {
    "record_id": 1890134,
    "text": "Customer reported the following issue: SIM details & IMEI are are not matching.. The issue is categorized under Others.",
    "category": "Others"
  },
  {
    "record_id": 1890135,
    "text": "Customer reported the following issue: Checked new applications in the market.. The issue is categorized under Others.",
    "category": "Others"
  },
  {
    "record_id": 1890136,
    "text": "Customer reported the following issue: Want to know if Whatsapp could be installed in the device.. The issue is categorized under Others.",
    "category": "Others"
  },
  {
    "record_id": 1890137,
    "text": "Customer reported the following issue: Wants to access News channels through phone.. The issue is categorized under Others.",
    "category": "Others"
  },
  {
    "record_id": 1890138,
    "text": "Customer reported the following issue: Customer wants to block calls from a particular number,. The issue is categorized under Others.",
    "category": "Others"
  },
  {
    "record_id": 1890139,
    "text": "Customer reported the following issue: Checking IMEI status.. The issue is categorized under Others.",
    "category": "Others"
  },
  {
    "record_id": 1890140,
    "text": "Customer reported the following issue: Called to report demise of her grandmother & want to cancel the connection.. The issue is categorized under Others.",
    "category": "Others"
  },
  {
    "record_id": 1890141,
    "text": "Customer reported the following issue: Checking IMEI status.. The issue is categorized under Others.",
    "category": "Others"
  },
  {
    "record_id": 1890142,
    "text": "Customer reported the following issue: #call?. The issue is categorized under Others.",
    "category": "Others"
  },
  {
    "record_id": 1890143,
    "text": "Customer reported the following issue: Se verificaron nuevas aplicaciones en el mercado.. The issue is categorized under Others.",
    "category": "Others"
  }
]